app/controllers/school_classes_controller.rb

  def show
    p @school_class
    @school_class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @school_class = SchoolClass.new
    @school_class.title = school_class_params[:title]
    @school_class.room_number = school_class_params[:room_number]
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "t9"], ["room_number", 9]]